package com.example.caloriestracker.ViewModels

import androidx.compose.runtime.State
import androidx.compose.runtime.mutableStateOf
import androidx.lifecycle.ViewModel
import androidx.lifecycle.viewModelScope
import com.example.caloriestracker.Models.ArticleModel
import com.example.caloriestracker.Models.Link
import com.example.caloriestracker.R
import kotlinx.coroutines.launch

class ArticleViewModel: ViewModel() {
    private val _articlesState = mutableStateOf(ArticlesState())
    val articlesState: State<ArticlesState> = _articlesState

    init{
        fetchArticles()
    }

    private fun fetchArticles() {
        viewModelScope.launch {
            _articlesState.value = _articlesState.value.copy(
                listOf( ArticleModel(
                    "Які основні принципи здорового харчування?",
                    "Здорове харчування - це ключовий аспект здорового способу життя, який сприяє оптимальному фізичному та психічному самопочуттю. Основні принципи здорового харчування включають збалансований раціон, різноманітність, модерацію, мінімізацію оброблених продуктів, гідрацію, модерацію цукрів і насичених жирів, фізичну активність та споживання відповідно до потреб.",
                    listOf(
                        Link(
                            link = "https://www.youtube.com/watch?v=HnoliuOviVg&ab_channel=%D0%9E%D0%BB%D1%8F%D0%9F%D1%96%D0%BD%D1%81-%D0%BA%D0%BE%D1%80%D0%B8%D1%81%D0%BD%D1%96%D1%96%D0%BF%D1%80%D0%BE%D1%81%D1%82%D1%96%D1%80%D0%B5%D1%86%D0%B5%D0%BF%D1%82%D0%B8%21",
                            title = "Перелік продуктів для схуднення та правильного харчування",
                            id = R.drawable.video1
                        ),
                        Link(
                            link = "https://www.youtube.com/watch?v=mIu1O0VFsvM&ab_channel=%D0%94%D1%96%D1%94%D0%BC%D0%BE%D0%B4%D0%BB%D1%8F%D0%B7%D0%B4%D0%BE%D1%80%D0%BE%D0%B2%27%D1%8F",
                            title = "Тарілка здорового харчування",
                            id = R.drawable.video2
                        ),
                        Link(
                            link = "https://www.youtube.com/watch?v=GefgKBFyNkM",
                            title = "З чого складається тарілка здорового харчування?",
                            id = R.drawable.video3
                        )
                    )
                ),
                    ArticleModel(
                        "Чому важливо контролювати калорії у раціоні?",
                        "Контроль калорій у раціоні важливий для збереження здоров'я та досягнення оптимальної ваги. Перевищення кількості спожитих калорій може призвести до надмірної ваги або ожиріння, що збільшує ризик розвитку хвороб, таких як цукровий діабет, серцево-судинні захворювання та інші проблеми зі здоров'ям. З іншого боку, недостатня кількість калорій може призвести до недостатнього набору ваги або навіть до втрати м'язової маси. Контроль калорій допомагає збалансувати раціон, забезпечуючи організм необхідною енергією та поживними речовинами для здорового функціонування.",
                        listOf(
                            Link(
                                link = "https://www.youtube.com/watch?v=OVeSV6dVH-M&ab_channel=MUSCLEUA-%D0%BF%D1%80%D0%BE%D1%81%D1%82%D0%BE%D0%BF%D1%80%D0%BE%D1%81%D0%BF%D0%BE%D1%80%D1%82%D0%B8%D0%B2%D0%BD%D0%B5%D1%85%D0%B0%D1%80%D1%87%D1%83%D0%B2%D0%B0%D0%BD%D0%BD%D1%8F",
                                title = "Що треба знати про калорії? Як худнути чи набирати вагу просто?",
                                id = R.drawable.video4
                            )
                        )
                    ),
                    ArticleModel(
                        "Корисні поради для підтримки здорової ваги",
                        " Декілька корисних порад для підтримки здорової ваги:\n" +
                                "\n" +
                                "Раціон: Спробуйте дотримуватися збалансованого харчування, яке включає в себе різноманітні продукти з усіх груп: овочі та фрукти, білки, злаки та здорові жири.\n" +
                                "\n" +
                                "Контроль порцій: Уважно слідкуйте за розмірами порцій, оскільки перевищення розмірів може призвести до надмірного споживання калорій.\n" +
                                "\n" +
                                "Гідна харчова заміна: Замініть шкідливі закуски та напої здоровими альтернативами, такими як свіжі фрукти, овочі, горіхи або йогурт.\n" +
                                "\n" +
                                "Вода: Підтримуйте водний баланс, пити достатню кількість води протягом дня. Це допомагає контролювати апетит та підтримує оптимальну роботу організму.\n" +
                                "\n" +
                                "Фізична активність: Регулярні фізичні вправи, такі як прогулянки, біг або заняття спортом, не лише допомагають зберегти здорову вагу, але й покращують настрій та загальний стан здоров'я.\n" +
                                "\n" +
                                "Сон: Забезпечте достатню кількість сну, оскільки недосипання може призвести до збільшення ваги через збільшення апетиту та зниження енергії для фізичної активності.\n" +
                                "\n" +
                                "Стрес-менеджмент: Навчіться ефективно керувати стресом, оскільки стрес може призвести до надмірного споживання їжі. Пошукайте засоби релаксації, такі як медитація або йога.\n" +
                                "\n" +
                                "Здоровий стиль життя: Уникайте шкідливих звичок, таких як куріння та вживання алкоголю, які можуть впливати на ваше здоров'я та вагу.",
                        listOf()
                    ),
                    ArticleModel(
                        "Як вибрати підходящий харчовий режим або дієту?",
                        "Вибір підходящого харчового режиму або дієти залежить від вашого здоров'я, цілей щодо ваги та особистих уподобань. Ось кілька кроків, які можуть допомогти вам вибрати правильний харчовий режим або дієту:\n" +
                                "\n" +
                                "Зверніться до лікаря або дієтолога: Перш ніж почати новий харчовий режим або дієту, краще консультуватися з фахівцем. Вони допоможуть визначити ваші потреби та рекомендації відповідно до вашого стану здоров'я.\n" +
                                "\n" +
                                "Врахуйте свої цілі: Які цілі ви ставите перед собою? Чи хочете ви схуднути, набрати м'язову масу, поліпшити здоров'я шкіри або контролювати рівень цукру в крові? Різні дієти спрямовані на різні цілі.\n" +
                                "\n" +
                                "Вивчайте різні варіанти: Існує безліч харчових режимів та дієт, таких як кето-дієта, веганство, дієта з низьким вмістом вуглеводів, сирова їжа і т. д. Ознайомтеся з різними варіантами та виберіть той, який найкраще відповідає вашим потребам та уподобанням.\n" +
                                "\n" +
                                "Дотримуйтесь балансу: Незалежно від того, який харчовий режим ви обираєте, важливо дотримуватися балансу. Забезпечте своє тіло різноманітною їжею з усіх груп харчування, включаючи овочі, фрукти, білки, злаки та здорові жири.\n" +
                                "\n" +
                                "Слухайте своє тіло: Кожен організм реагує по-різному на різні типи їжі. Слухайте своє тіло та реагуйте на його сигнали. Якщо ви помічаєте негативну реакцію на певні продукти або дієти, то можливо, вони вам не підходять.",
                        listOf()
                    ),
                    ArticleModel(
                        "Що таке РДНС?",
                        "РДНС означає \"рекомендовані денні норми споживання\". Це набір рекомендацій щодо кількості поживних речовин, які людина повинна споживати щодня, щоб забезпечити своє здоров'я і добробут. РДНС враховують різні фактори, такі як вік, стать, фізична активність та інші індивідуальні характеристики.\n" +
                                "\n" +
                                "Ці норми встановлюються на основі наукових досліджень і рекомендуються організаціями з охорони здоров'я та харчової промисловості. Вони визначають оптимальну кількість енергії, вуглеводів, білків, жирів, вітамінів, мінералів та інших поживних речовин для забезпечення правильного функціонування організму.\n" +
                                "\n" +
                                "Споживання продуктів відповідно до РДНС може допомогти підтримати оптимальне здоров'я, запобігти недостатньому або надмірному споживанню поживних речовин, а також зменшити ризик розвитку хвороб і захворювань, пов'язаних з неправильним харчуванням.",
                        listOf()
                    ))
            )
        }
    }


    data class ArticlesState(
        val articleList: List<ArticleModel> = emptyList()
    )
}